const cityData = [
    {
        "initial": "A",
        "list": [
            {
                "zip": "0837",
                "name": "阿坝"
            },
            {
                "zip": "0997",
                "name": "阿克苏"
            },
            {
                "zip": "0483",
                "name": "阿拉善盟"
            },
            {
                "zip": "0906",
                "name": "阿勒泰"
            },
            {
                "zip": "0897",
                "name": "阿里"
            },
            {
                "zip": "0915",
                "name": "安康"
            },
            {
                "zip": "0556",
                "name": "安庆"
            },
            {
                "zip": "0412",
                "name": "鞍山"
            },
            {
                "zip": "0853",
                "name": "安顺"
            },
            {
                "zip": "0372",
                "name": "安阳"
            },
            {
                "zip": "0451",
                "name": "阿城"
            },
            {
                "zip": "0796",
                "name": "安福"
            },
            {
                "zip": "0572",
                "name": "安吉"
            },
            {
                "zip": "0871",
                "name": "安宁"
            },
            {
                "zip": "0536",
                "name": "安丘"
            },
            {
                "zip": "0595",
                "name": "安溪"
            },
            {
                "zip": "0791",
                "name": "安义"
            },
            {
                "zip": "0797",
                "name": "安远"
            }
        ]
    },
    {
        "initial": "B",
        "list": [
            {
                "zip": "010",
                "name": "北京"
            },
            {
                "zip": "0436",
                "name": "白城"
            },
            {
                "zip": "0776",
                "name": "百色"
            },
            {
                "zip": "0439",
                "name": "白山"
            },
            {
                "zip": "0943",
                "name": "白银"
            },
            {
                "zip": "0552",
                "name": "蚌埠"
            },
            {
                "zip": "0312",
                "name": "保定"
            },
            {
                "zip": "0917",
                "name": "宝鸡"
            },
            {
                "zip": "0875",
                "name": "保山"
            },
            {
                "zip": "0472",
                "name": "包头"
            },
            {
                "zip": "0478",
                "name": "巴彦淖尔"
            },
            {
                "zip": "0996",
                "name": "巴音郭楞"
            },
            {
                "zip": "0827",
                "name": "巴中"
            },
            {
                "zip": "0779",
                "name": "北海"
            },
            {
                "zip": "0414",
                "name": "本溪"
            },
            {
                "zip": "0857",
                "name": "毕节"
            },
            {
                "zip": "0543",
                "name": "滨州"
            },
            {
                "zip": "0909",
                "name": "博尔塔拉"
            },
            {
                "zip": "0558",
                "name": "亳州"
            },
            {
                "zip": "0514",
                "name": "宝应"
            },
            {
                "zip": "0451",
                "name": "巴彦"
            },
            {
                "zip": "0515",
                "name": "滨海"
            },
            {
                "zip": "0451",
                "name": "宾县"
            },
            {
                "zip": "0771",
                "name": "宾阳"
            },
            {
                "zip": "023",
                "name": "璧山"
            },
            {
                "zip": "0391",
                "name": "博爱"
            },
            {
                "zip": "0752",
                "name": "博罗"
            },
            {
                "zip": "0543",
                "name": "博兴"
            }
        ]
    },
    {
        "initial": "C",
        "list": [
            {
                "zip": "023",
                "name": "重庆"
            },
            {
                "zip": "0431",
                "name": "长春"
            },
            {
                "zip": "0731",
                "name": "长沙"
            },
            {
                "zip": "0519",
                "name": "常州"
            },
            {
                "zip": "028",
                "name": "成都"
            },
            {
                "zip": "0317",
                "name": "沧州"
            },
            {
                "zip": "0736",
                "name": "常德"
            },
            {
                "zip": "0895",
                "name": "昌都"
            },
            {
                "zip": "0997",
                "name": "昌吉"
            },
            {
                "zip": "0355",
                "name": "长治"
            },
            {
                "zip": "0565",
                "name": "巢湖"
            },
            {
                "zip": "0421",
                "name": "朝阳"
            },
            {
                "zip": "0768",
                "name": "潮州"
            },
            {
                "zip": "0314",
                "name": "承德"
            },
            {
                "zip": "0735",
                "name": "郴州"
            },
            {
                "zip": "0476",
                "name": "赤峰"
            },
            {
                "zip": "0566",
                "name": "池州"
            },
            {
                "zip": "0771",
                "name": "崇左"
            },
            {
                "zip": "0875",
                "name": "楚雄"
            },
            {
                "zip": "0550",
                "name": "滁州"
            },
            {
                "zip": "0577",
                "name": "苍南"
            },
            {
                "zip": "0539",
                "name": "苍山"
            },
            {
                "zip": "0530",
                "name": "曹县"
            },
            {
                "zip": "0535",
                "name": "长岛"
            },
            {
                "zip": "0551",
                "name": "长丰"
            },
            {
                "zip": "0411",
                "name": "长海"
            },
            {
                "zip": "0591",
                "name": "长乐"
            },
            {
                "zip": "0536",
                "name": "昌乐"
            },
            {
                "zip": "0570",
                "name": "常山"
            },
            {
                "zip": "0512",
                "name": "常熟"
            },
            {
                "zip": "0596",
                "name": "长泰"
            },
            {
                "zip": "0597",
                "name": "长汀"
            },
            {
                "zip": "0572",
                "name": "长兴"
            },
            {
                "zip": "0536",
                "name": "昌邑"
            },
            {
                "zip": "0768",
                "name": "潮安"
            },
            {
                "zip": "0871",
                "name": "呈贡"
            },
            {
                "zip": "023",
                "name": "城口"
            },
            {
                "zip": "0530",
                "name": "成武"
            },
            {
                "zip": "0635",
                "name": "茌平"
            },
            {
                "zip": "0794",
                "name": "崇仁"
            },
            {
                "zip": "0797",
                "name": "崇义"
            },
            {
                "zip": "028",
                "name": "崇州"
            },
            {
                "zip": "0571",
                "name": "淳安"
            },
            {
                "zip": "0574",
                "name": "慈溪"
            },
            {
                "zip": "020",
                "name": "从化"
            },
            {
                "zip": "0556",
                "name": "枞阳"
            }
        ]
    },
    {
        "initial": "D",
        "list": [
            {
                "zip": "0411",
                "name": "大连"
            },
            {
                "zip": "0769",
                "name": "东莞"
            },
            {
                "zip": "0872",
                "name": "大理"
            },
            {
                "zip": "0415",
                "name": "丹东"
            },
            {
                "zip": "0459",
                "name": "大庆"
            },
            {
                "zip": "0352",
                "name": "大同"
            },
            {
                "zip": "0457",
                "name": "大兴安岭"
            },
            {
                "zip": "0818",
                "name": "达州"
            },
            {
                "zip": "0692",
                "name": "德宏"
            },
            {
                "zip": "0838",
                "name": "德阳"
            },
            {
                "zip": "0534",
                "name": "德州"
            },
            {
                "zip": "0932",
                "name": "定西"
            },
            {
                "zip": "0887",
                "name": "迪庆"
            },
            {
                "zip": "0546",
                "name": "东营"
            },
            {
                "zip": "0515",
                "name": "大丰"
            },
            {
                "zip": "0580",
                "name": "岱山"
            },
            {
                "zip": "0557",
                "name": "砀山"
            },
            {
                "zip": "0555",
                "name": "当涂"
            },
            {
                "zip": "0530",
                "name": "单县"
            },
            {
                "zip": "0511",
                "name": "丹阳"
            },
            {
                "zip": "0753",
                "name": "大埔"
            },
            {
                "zip": "0598",
                "name": "大田"
            },
            {
                "zip": "028",
                "name": "大邑"
            },
            {
                "zip": "0797",
                "name": "大余"
            },
            {
                "zip": "023",
                "name": "大足"
            },
            {
                "zip": "0792",
                "name": "德安"
            },
            {
                "zip": "0595",
                "name": "德化"
            },
            {
                "zip": "0431",
                "name": "德惠"
            },
            {
                "zip": "0371",
                "name": "登封"
            },
            {
                "zip": "0572",
                "name": "德清"
            },
            {
                "zip": "0758",
                "name": "德庆"
            },
            {
                "zip": "0793",
                "name": "德兴"
            },
            {
                "zip": "0668",
                "name": "电白"
            },
            {
                "zip": "023",
                "name": "垫江"
            },
            {
                "zip": "0797",
                "name": "定南"
            },
            {
                "zip": "0530",
                "name": "定陶"
            },
            {
                "zip": "0550",
                "name": "定远"
            },
            {
                "zip": "0635",
                "name": "东阿"
            },
            {
                "zip": "0518",
                "name": "东海"
            },
            {
                "zip": "0530",
                "name": "东明"
            },
            {
                "zip": "0538",
                "name": "东平"
            },
            {
                "zip": "0596",
                "name": "东山"
            },
            {
                "zip": "0515",
                "name": "东台"
            },
            {
                "zip": "0577",
                "name": "洞头"
            },
            {
                "zip": "0794",
                "name": "东乡"
            },
            {
                "zip": "0579",
                "name": "东阳"
            },
            {
                "zip": "0762",
                "name": "东源"
            },
            {
                "zip": "0566",
                "name": "东至"
            },
            {
                "zip": "0792",
                "name": "都昌"
            },
            {
                "zip": "028",
                "name": "都江堰"
            }
        ]
    },
    {
        "initial": "E",
        "list": [
            {
                "zip": "0477",
                "name": "鄂尔多斯"
            },
            {
                "zip": "0718",
                "name": "恩施"
            },
            {
                "zip": "0711",
                "name": "鄂州"
            },
            {
                "zip": "0750",
                "name": "恩平"
            }
        ]
    },
    {
        "initial": "F",
        "list": [
            {
                "zip": "0757",
                "name": "佛山"
            },
            {
                "zip": "0591",
                "name": "福州"
            },
            {
                "zip": "0770",
                "name": "防城港"
            },
            {
                "zip": "0413",
                "name": "抚顺"
            },
            {
                "zip": "0418",
                "name": "阜新"
            },
            {
                "zip": "0558",
                "name": "阜阳"
            },
            {
                "zip": "0794",
                "name": "抚州"
            },
            {
                "zip": "024",
                "name": "法库"
            },
            {
                "zip": "0553",
                "name": "繁昌"
            },
            {
                "zip": "0451",
                "name": "方正"
            },
            {
                "zip": "0538",
                "name": "肥城"
            },
            {
                "zip": "0551",
                "name": "肥东"
            },
            {
                "zip": "0551",
                "name": "肥西"
            },
            {
                "zip": "0539",
                "name": "费县"
            },
            {
                "zip": "0795",
                "name": "丰城"
            },
            {
                "zip": "023",
                "name": "丰都"
            },
            {
                "zip": "0574",
                "name": "奉化"
            },
            {
                "zip": "023",
                "name": "奉节"
            },
            {
                "zip": "0758",
                "name": "封开"
            },
            {
                "zip": "0753",
                "name": "丰顺"
            },
            {
                "zip": "0554",
                "name": "凤台"
            },
            {
                "zip": "0516",
                "name": "丰县"
            },
            {
                "zip": "0795",
                "name": "奉新"
            },
            {
                "zip": "0550",
                "name": "凤阳"
            },
            {
                "zip": "0790",
                "name": "分宜"
            },
            {
                "zip": "0763",
                "name": "佛冈"
            },
            {
                "zip": "0593",
                "name": "福安"
            },
            {
                "zip": "0593",
                "name": "福鼎"
            },
            {
                "zip": "0798",
                "name": "浮梁"
            },
            {
                "zip": "0871",
                "name": "富民"
            },
            {
                "zip": "0558",
                "name": "阜南"
            },
            {
                "zip": "0515",
                "name": "阜宁"
            },
            {
                "zip": "0591",
                "name": "福清"
            },
            {
                "zip": "0571",
                "name": "富阳"
            }
        ]
    },
    {
        "initial": "G",
        "list": [
            {
                "zip": "020",
                "name": "广州"
            },
            {
                "zip": "0851",
                "name": "贵阳"
            },
            {
                "zip": "0941",
                "name": "甘南"
            },
            {
                "zip": "0797",
                "name": "赣州"
            },
            {
                "zip": "0836",
                "name": "甘孜"
            },
            {
                "zip": "0826",
                "name": "广安"
            },
            {
                "zip": "0839",
                "name": "广元"
            },
            {
                "zip": "0775",
                "name": "贵港"
            },
            {
                "zip": "0773",
                "name": "桂林"
            },
            {
                "zip": "0975",
                "name": "果洛"
            },
            {
                "zip": "0954",
                "name": "固原"
            },
            {
                "zip": "0797",
                "name": "赣县"
            },
            {
                "zip": "0518",
                "name": "赣榆"
            },
            {
                "zip": "0795",
                "name": "高安"
            },
            {
                "zip": "0311",
                "name": "藁城"
            },
            {
                "zip": "025",
                "name": "高淳"
            },
            {
                "zip": "0931",
                "name": "皋兰"
            },
            {
                "zip": "029",
                "name": "高陵"
            },
            {
                "zip": "0536",
                "name": "高密"
            },
            {
                "zip": "0533",
                "name": "高青"
            },
            {
                "zip": "0635",
                "name": "高唐"
            },
            {
                "zip": "0758",
                "name": "高要"
            },
            {
                "zip": "0311",
                "name": "高邑"
            },
            {
                "zip": "0514",
                "name": "高邮"
            },
            {
                "zip": "0668",
                "name": "高州"
            },
            {
                "zip": "0371",
                "name": "巩义"
            },
            {
                "zip": "0794",
                "name": "广昌"
            },
            {
                "zip": "0563",
                "name": "广德"
            },
            {
                "zip": "0793",
                "name": "广丰"
            },
            {
                "zip": "0758",
                "name": "广宁"
            },
            {
                "zip": "0546",
                "name": "广饶"
            },
            {
                "zip": "0599",
                "name": "光泽"
            },
            {
                "zip": "0518",
                "name": "灌南"
            },
            {
                "zip": "0635",
                "name": "冠县"
            },
            {
                "zip": "0518",
                "name": "灌云"
            },
            {
                "zip": "0701",
                "name": "贵溪"
            },
            {
                "zip": "0593",
                "name": "古田"
            },
            {
                "zip": "0552",
                "name": "固镇"
            }
        ]
    },
    {
        "initial": "H",
        "list": [
            {
                "zip": "0451",
                "name": "哈尔滨"
            },
            {
                "zip": "0898",
                "name": "海口"
            },
            {
                "zip": "0310",
                "name": "邯郸"
            },
            {
                "zip": "0571",
                "name": "杭州"
            },
            {
                "zip": "0551",
                "name": "合肥"
            },
            {
                "zip": "0752",
                "name": "惠州"
            },
            {
                "zip": "0970",
                "name": "海北"
            },
            {
                "zip": "0972",
                "name": "海东"
            },
            {
                "zip": "0974",
                "name": "海南"
            },
            {
                "zip": "0977",
                "name": "海西"
            },
            {
                "zip": "0902",
                "name": "哈密"
            },
            {
                "zip": "0916",
                "name": "汉中"
            },
            {
                "zip": "0392",
                "name": "鹤壁"
            },
            {
                "zip": "0778",
                "name": "河池"
            },
            {
                "zip": "0468",
                "name": "鹤岗"
            },
            {
                "zip": "0456",
                "name": "黑河"
            },
            {
                "zip": "0318",
                "name": "衡水"
            },
            {
                "zip": "0734",
                "name": "衡阳"
            },
            {
                "zip": "0903",
                "name": "和田地"
            },
            {
                "zip": "0762",
                "name": "河源"
            },
            {
                "zip": "0530",
                "name": "菏泽"
            },
            {
                "zip": "0774",
                "name": "贺州"
            },
            {
                "zip": "0873",
                "name": "红河"
            },
            {
                "zip": "0517",
                "name": "淮安"
            },
            {
                "zip": "0561",
                "name": "淮北"
            },
            {
                "zip": "0745",
                "name": "怀化"
            },
            {
                "zip": "0554",
                "name": "淮南"
            },
            {
                "zip": "0713",
                "name": "黄冈"
            },
            {
                "zip": "0973",
                "name": "黄南"
            },
            {
                "zip": "0559",
                "name": "黄山"
            },
            {
                "zip": "0714",
                "name": "黄石"
            },
            {
                "zip": "0471",
                "name": "呼和浩特"
            },
            {
                "zip": "0429",
                "name": "葫芦岛"
            },
            {
                "zip": "0470",
                "name": "呼伦贝尔"
            },
            {
                "zip": "0572",
                "name": "湖州"
            },
            {
                "zip": "0513",
                "name": "海安"
            },
            {
                "zip": "0660",
                "name": "海丰"
            },
            {
                "zip": "0513",
                "name": "海门"
            },
            {
                "zip": "0573",
                "name": "海宁"
            },
            {
                "zip": "0573",
                "name": "海盐"
            },
            {
                "zip": "0535",
                "name": "海阳"
            },
            {
                "zip": "0565",
                "name": "含山"
            },
            {
                "zip": "023",
                "name": "合川"
            },
            {
                "zip": "0793",
                "name": "横峰"
            },
            {
                "zip": "0771",
                "name": "横县"
            },
            {
                "zip": "0762",
                "name": "和平"
            },
            {
                "zip": "0750",
                "name": "鹤山"
            },
            {
                "zip": "0565",
                "name": "和县"
            },
            {
                "zip": "0517",
                "name": "洪泽"
            },
            {
                "zip": "0596",
                "name": "华安"
            },
            {
                "zip": "0423",
                "name": "桦甸"
            },
            {
                "zip": "0758",
                "name": "怀集"
            },
            {
                "zip": "0556",
                "name": "怀宁"
            },
            {
                "zip": "0552",
                "name": "怀远"
            },
            {
                "zip": "0533",
                "name": "桓台"
            },
            {
                "zip": "0668",
                "name": "化州"
            },
            {
                "zip": "0595",
                "name": "惠安"
            },
            {
                "zip": "0797",
                "name": "会昌"
            },
            {
                "zip": "0752",
                "name": "惠东"
            },
            {
                "zip": "0663",
                "name": "惠来"
            },
            {
                "zip": "0543",
                "name": "惠民"
            },
            {
                "zip": "0792",
                "name": "湖口"
            },
            {
                "zip": "0451",
                "name": "呼兰"
            },
            {
                "zip": "0564",
                "name": "霍邱"
            },
            {
                "zip": "0564",
                "name": "霍山"
            },
            {
                "zip": "029",
                "name": "户县"
            }
        ]
    },
    {
        "initial": "J",
        "list": [
            {
                "zip": "0391",
                "name": "焦作"
            },
            {
                "zip": "0573",
                "name": "嘉兴"
            },
            {
                "zip": "0423",
                "name": "吉林"
            },
            {
                "zip": "0531",
                "name": "济南"
            },
            {
                "zip": "0454",
                "name": "佳木斯"
            },
            {
                "zip": "0750",
                "name": "江门"
            },
            {
                "zip": "0796",
                "name": "吉安"
            },
            {
                "zip": "0937",
                "name": "嘉峪关"
            },
            {
                "zip": "0663",
                "name": "揭阳"
            },
            {
                "zip": "0935",
                "name": "金昌"
            },
            {
                "zip": "0356",
                "name": "晋城"
            },
            {
                "zip": "0798",
                "name": "景德镇"
            },
            {
                "zip": "0724",
                "name": "荆门"
            },
            {
                "zip": "0716",
                "name": "荆州"
            },
            {
                "zip": "0579",
                "name": "金华"
            },
            {
                "zip": "0537",
                "name": "济宁"
            },
            {
                "zip": "0354",
                "name": "晋中"
            },
            {
                "zip": "0416",
                "name": "锦州"
            },
            {
                "zip": "0792",
                "name": "九江"
            },
            {
                "zip": "0937",
                "name": "酒泉"
            },
            {
                "zip": "0467",
                "name": "鸡西"
            },
            {
                "zip": "0571",
                "name": "建德"
            },
            {
                "zip": "0514",
                "name": "江都"
            },
            {
                "zip": "023",
                "name": "江津"
            },
            {
                "zip": "0598",
                "name": "将乐"
            },
            {
                "zip": "0570",
                "name": "江山"
            },
            {
                "zip": "0523",
                "name": "姜堰"
            },
            {
                "zip": "0510",
                "name": "江阴"
            },
            {
                "zip": "0515",
                "name": "建湖"
            },
            {
                "zip": "0598",
                "name": "建宁"
            },
            {
                "zip": "0599",
                "name": "建瓯"
            },
            {
                "zip": "0599",
                "name": "建阳"
            },
            {
                "zip": "0796",
                "name": "吉安"
            },
            {
                "zip": "0423",
                "name": "蛟河"
            },
            {
                "zip": "0753",
                "name": "蕉岭"
            },
            {
                "zip": "0532",
                "name": "胶南"
            },
            {
                "zip": "0532",
                "name": "胶州"
            },
            {
                "zip": "0573",
                "name": "嘉善"
            },
            {
                "zip": "0537",
                "name": "嘉祥"
            },
            {
                "zip": "0663",
                "name": "揭东"
            },
            {
                "zip": "0558",
                "name": "界首"
            },
            {
                "zip": "0663",
                "name": "揭西"
            },
            {
                "zip": "0532",
                "name": "即墨"
            },
            {
                "zip": "0795",
                "name": "靖安"
            },
            {
                "zip": "0563",
                "name": "旌德"
            },
            {
                "zip": "0796",
                "name": "井冈山"
            },
            {
                "zip": "0523",
                "name": "靖江"
            },
            {
                "zip": "0578",
                "name": "景宁"
            },
            {
                "zip": "0563",
                "name": "泾县"
            },
            {
                "zip": "0311",
                "name": "井陉"
            },
            {
                "zip": "0517",
                "name": "金湖"
            },
            {
                "zip": "0595",
                "name": "晋江"
            },
            {
                "zip": "0595",
                "name": "金门"
            },
            {
                "zip": "0871",
                "name": "晋宁"
            },
            {
                "zip": "0519",
                "name": "金坛"
            },
            {
                "zip": "028",
                "name": "金堂"
            },
            {
                "zip": "0791",
                "name": "进贤"
            },
            {
                "zip": "0794",
                "name": "金溪"
            },
            {
                "zip": "0537",
                "name": "金乡"
            },
            {
                "zip": "0578",
                "name": "缙云"
            },
            {
                "zip": "0564",
                "name": "金寨"
            },
            {
                "zip": "0311",
                "name": "晋州"
            },
            {
                "zip": "0796",
                "name": "吉水"
            },
            {
                "zip": "0792",
                "name": "九江"
            },
            {
                "zip": "0431",
                "name": "九台"
            },
            {
                "zip": "0563",
                "name": "绩溪"
            },
            {
                "zip": "0531",
                "name": "济阳"
            },
            {
                "zip": "0391",
                "name": "济源"
            },
            {
                "zip": "0530",
                "name": "鄄城"
            },
            {
                "zip": "0539",
                "name": "莒南"
            },
            {
                "zip": "0511",
                "name": "句容"
            },
            {
                "zip": "0633",
                "name": "莒县"
            },
            {
                "zip": "0530",
                "name": "巨野"
            }
        ]
    },
    {
        "initial": "K",
        "list": [
            {
                "zip": "0871",
                "name": "昆明"
            },
            {
                "zip": "0378",
                "name": "开封"
            },
            {
                "zip": "0998",
                "name": "喀什地"
            },
            {
                "zip": "0990",
                "name": "克拉玛依"
            },
            {
                "zip": "0908",
                "name": "克孜勒"
            },
            {
                "zip": "0570",
                "name": "开化"
            },
            {
                "zip": "0750",
                "name": "开平"
            },
            {
                "zip": "023",
                "name": "开县"
            },
            {
                "zip": "0851",
                "name": "开阳"
            },
            {
                "zip": "024",
                "name": "康平"
            },
            {
                "zip": "0546",
                "name": "垦利"
            },
            {
                "zip": "0512",
                "name": "昆山"
            }
        ]
    },
    {
        "initial": "L",
        "list": [
            {
                "zip": "0931",
                "name": "兰州"
            },
            {
                "zip": "0772",
                "name": "柳州"
            },
            {
                "zip": "0379",
                "name": "洛阳"
            },
            {
                "zip": "0772",
                "name": "来宾"
            },
            {
                "zip": "0634",
                "name": "莱芜"
            },
            {
                "zip": "0316",
                "name": "廊坊"
            },
            {
                "zip": "0891",
                "name": "拉萨"
            },
            {
                "zip": "0833",
                "name": "乐山"
            },
            {
                "zip": "0834",
                "name": "凉山"
            },
            {
                "zip": "0518",
                "name": "连云港"
            },
            {
                "zip": "0635",
                "name": "聊城"
            },
            {
                "zip": "0419",
                "name": "辽阳"
            },
            {
                "zip": "0437",
                "name": "辽源"
            },
            {
                "zip": "0888",
                "name": "丽江"
            },
            {
                "zip": "0883",
                "name": "临沧"
            },
            {
                "zip": "0357",
                "name": "临汾"
            },
            {
                "zip": "0930",
                "name": "临夏"
            },
            {
                "zip": "0539",
                "name": "临沂"
            },
            {
                "zip": "0894",
                "name": "林芝"
            },
            {
                "zip": "0578",
                "name": "丽水"
            },
            {
                "zip": "0564",
                "name": "六安"
            },
            {
                "zip": "0858",
                "name": "六盘水"
            },
            {
                "zip": "0939",
                "name": "陇南"
            },
            {
                "zip": "0597",
                "name": "龙岩"
            },
            {
                "zip": "0738",
                "name": "娄底"
            },
            {
                "zip": "0395",
                "name": "漯河"
            },
            {
                "zip": "0830",
                "name": "泸州"
            },
            {
                "zip": "0358",
                "name": "吕梁"
            },
            {
                "zip": "0550",
                "name": "来安"
            },
            {
                "zip": "0532",
                "name": "莱西"
            },
            {
                "zip": "0535",
                "name": "莱阳"
            },
            {
                "zip": "0535",
                "name": "莱州"
            },
            {
                "zip": "0563",
                "name": "郎溪"
            },
            {
                "zip": "029",
                "name": "蓝田"
            },
            {
                "zip": "0579",
                "name": "兰溪"
            },
            {
                "zip": "0794",
                "name": "乐安"
            },
            {
                "zip": "0751",
                "name": "乐昌"
            },
            {
                "zip": "0759",
                "name": "雷州"
            },
            {
                "zip": "0534",
                "name": "乐陵"
            },
            {
                "zip": "0798",
                "name": "乐平"
            },
            {
                "zip": "0577",
                "name": "乐清"
            },
            {
                "zip": "0315",
                "name": "乐亭"
            },
            {
                "zip": "0597",
                "name": "连城"
            },
            {
                "zip": "023",
                "name": "梁平"
            },
            {
                "zip": "0537",
                "name": "梁山"
            },
            {
                "zip": "0799",
                "name": "莲花"
            },
            {
                "zip": "0591",
                "name": "连江"
            },
            {
                "zip": "0759",
                "name": "廉江"
            },
            {
                "zip": "0763",
                "name": "连南"
            },
            {
                "zip": "0762",
                "name": "连平"
            },
            {
                "zip": "0763",
                "name": "连山"
            },
            {
                "zip": "0517",
                "name": "涟水"
            },
            {
                "zip": "0763",
                "name": "连州"
            },
            {
                "zip": "024",
                "name": "辽中"
            },
            {
                "zip": "0794",
                "name": "黎川"
            },
            {
                "zip": "0546",
                "name": "利津"
            },
            {
                "zip": "0571",
                "name": "临安"
            },
            {
                "zip": "0557",
                "name": "灵璧"
            },
            {
                "zip": "0311",
                "name": "灵寿"
            },
            {
                "zip": "0534",
                "name": "陵县"
            },
            {
                "zip": "0576",
                "name": "临海"
            },
            {
                "zip": "0635",
                "name": "临清"
            },
            {
                "zip": "0558",
                "name": "临泉"
            },
            {
                "zip": "0536",
                "name": "临朐"
            },
            {
                "zip": "0539",
                "name": "临沭"
            },
            {
                "zip": "0534",
                "name": "临邑"
            },
            {
                "zip": "025",
                "name": "溧水"
            },
            {
                "zip": "0772",
                "name": "柳城"
            },
            {
                "zip": "0772",
                "name": "柳江"
            },
            {
                "zip": "0731",
                "name": "浏阳"
            },
            {
                "zip": "0558",
                "name": "利辛"
            },
            {
                "zip": "0519",
                "name": "溧阳"
            },
            {
                "zip": "0771",
                "name": "隆安"
            },
            {
                "zip": "0762",
                "name": "龙川"
            },
            {
                "zip": "0596",
                "name": "龙海"
            },
            {
                "zip": "0535",
                "name": "龙口"
            },
            {
                "zip": "0752",
                "name": "龙门"
            },
            {
                "zip": "0797",
                "name": "龙南"
            },
            {
                "zip": "0578",
                "name": "龙泉"
            },
            {
                "zip": "0570",
                "name": "龙游"
            },
            {
                "zip": "0311",
                "name": "栾城"
            },
            {
                "zip": "0379",
                "name": "栾川"
            },
            {
                "zip": "0315",
                "name": "滦南"
            },
            {
                "zip": "0315",
                "name": "滦县"
            },
            {
                "zip": "0660",
                "name": "陆丰"
            },
            {
                "zip": "0660",
                "name": "陆河"
            },
            {
                "zip": "0565",
                "name": "庐江"
            },
            {
                "zip": "0766",
                "name": "罗定"
            },
            {
                "zip": "0379",
                "name": "洛宁"
            },
            {
                "zip": "0591",
                "name": "罗源"
            },
            {
                "zip": "0311",
                "name": "鹿泉"
            },
            {
                "zip": "0871",
                "name": "禄劝"
            },
            {
                "zip": "0799",
                "name": "芦溪"
            },
            {
                "zip": "0772",
                "name": "鹿寨"
            }
        ]
    },
    {
        "initial": "M",
        "list": [
            {
                "zip": "0555",
                "name": "马鞍山"
            },
            {
                "zip": "0668",
                "name": "茂名"
            },
            {
                "zip": "028",
                "name": "眉山"
            },
            {
                "zip": "0753",
                "name": "梅州"
            },
            {
                "zip": "0816",
                "name": "绵阳"
            },
            {
                "zip": "0453",
                "name": "牡丹江"
            },
            {
                "zip": "0771",
                "name": "马山"
            },
            {
                "zip": "0753",
                "name": "梅县"
            },
            {
                "zip": "0558",
                "name": "蒙城"
            },
            {
                "zip": "0379",
                "name": "孟津"
            },
            {
                "zip": "0539",
                "name": "蒙阴"
            },
            {
                "zip": "0391",
                "name": "孟州"
            },
            {
                "zip": "0550",
                "name": "明光"
            },
            {
                "zip": "0598",
                "name": "明溪"
            },
            {
                "zip": "0591",
                "name": "闽侯"
            },
            {
                "zip": "0591",
                "name": "闽清"
            },
            {
                "zip": "0451",
                "name": "木兰"
            }
        ]
    },
    {
        "initial": "N",
        "list": [
            {
                "zip": "0791",
                "name": "南昌"
            },
            {
                "zip": "025",
                "name": "南京"
            },
            {
                "zip": "0771",
                "name": "南宁"
            },
            {
                "zip": "0513",
                "name": "南通"
            },
            {
                "zip": "0574",
                "name": "宁波"
            },
            {
                "zip": "0817",
                "name": "南充"
            },
            {
                "zip": "0599",
                "name": "南平"
            },
            {
                "zip": "0377",
                "name": "南阳"
            },
            {
                "zip": "0896",
                "name": "那曲"
            },
            {
                "zip": "0832",
                "name": "内江"
            },
            {
                "zip": "0593",
                "name": "宁德"
            },
            {
                "zip": "0886",
                "name": "怒江"
            },
            {
                "zip": "0595",
                "name": "南安"
            },
            {
                "zip": "0754",
                "name": "南澳"
            },
            {
                "zip": "0794",
                "name": "南城"
            },
            {
                "zip": "023",
                "name": "南川"
            },
            {
                "zip": "0794",
                "name": "南丰"
            },
            {
                "zip": "0596",
                "name": "南靖"
            },
            {
                "zip": "0797",
                "name": "南康"
            },
            {
                "zip": "0553",
                "name": "南陵"
            },
            {
                "zip": "0751",
                "name": "南雄"
            },
            {
                "zip": "0797",
                "name": "宁都"
            },
            {
                "zip": "0563",
                "name": "宁国"
            },
            {
                "zip": "0574",
                "name": "宁海"
            },
            {
                "zip": "0598",
                "name": "宁化"
            },
            {
                "zip": "0534",
                "name": "宁津"
            },
            {
                "zip": "0731",
                "name": "宁乡"
            },
            {
                "zip": "0538",
                "name": "宁阳"
            },
            {
                "zip": "0431",
                "name": "农安"
            }
        ]
    },
    {
        "initial": "P",
        "list": [
            {
                "zip": "0427",
                "name": "盘锦"
            },
            {
                "zip": "0812",
                "name": "攀枝花"
            },
            {
                "zip": "0375",
                "name": "平顶山"
            },
            {
                "zip": "0933",
                "name": "平凉"
            },
            {
                "zip": "0799",
                "name": "萍乡"
            },
            {
                "zip": "0879",
                "name": "普洱"
            },
            {
                "zip": "0594",
                "name": "莆田"
            },
            {
                "zip": "0393",
                "name": "濮阳"
            },
            {
                "zip": "0579",
                "name": "磐安"
            },
            {
                "zip": "0423",
                "name": "磐石"
            },
            {
                "zip": "0516",
                "name": "沛县"
            },
            {
                "zip": "0535",
                "name": "蓬莱"
            },
            {
                "zip": "023",
                "name": "彭水"
            },
            {
                "zip": "0792",
                "name": "彭泽"
            },
            {
                "zip": "028",
                "name": "彭州"
            },
            {
                "zip": "0532",
                "name": "平度"
            },
            {
                "zip": "0596",
                "name": "平和"
            },
            {
                "zip": "0573",
                "name": "平湖"
            },
            {
                "zip": "0593",
                "name": "屏南"
            },
            {
                "zip": "0311",
                "name": "平山"
            },
            {
                "zip": "0591",
                "name": "平潭"
            },
            {
                "zip": "0577",
                "name": "平阳"
            },
            {
                "zip": "0531",
                "name": "平阴"
            },
            {
                "zip": "0539",
                "name": "平邑"
            },
            {
                "zip": "0534",
                "name": "平原"
            },
            {
                "zip": "0753",
                "name": "平远"
            },
            {
                "zip": "028",
                "name": "郫县"
            },
            {
                "zip": "0516",
                "name": "邳州"
            },
            {
                "zip": "0793",
                "name": "鄱阳"
            },
            {
                "zip": "0599",
                "name": "浦城"
            },
            {
                "zip": "0579",
                "name": "浦江"
            },
            {
                "zip": "028",
                "name": "蒲江"
            },
            {
                "zip": "0411",
                "name": "普兰店"
            },
            {
                "zip": "0663",
                "name": "普宁"
            }
        ]
    },
    {
        "initial": "Q",
        "list": [
            {
                "zip": "0532",
                "name": "青岛"
            },
            {
                "zip": "0595",
                "name": "泉州"
            },
            {
                "zip": "0855",
                "name": "黔东"
            },
            {
                "zip": "0854",
                "name": "黔南"
            },
            {
                "zip": "0859",
                "name": "黔西南"
            },
            {
                "zip": "0934",
                "name": "庆阳"
            },
            {
                "zip": "0763",
                "name": "清远"
            },
            {
                "zip": "0335",
                "name": "秦皇岛"
            },
            {
                "zip": "0777",
                "name": "钦州"
            },
            {
                "zip": "0452",
                "name": "齐齐哈尔"
            },
            {
                "zip": "0464",
                "name": "七台河"
            },
            {
                "zip": "0874",
                "name": "曲靖"
            },
            {
                "zip": "0570",
                "name": "衢州"
            },
            {
                "zip": "0315",
                "name": "迁安"
            },
            {
                "zip": "0556",
                "name": "潜山"
            },
            {
                "zip": "0793",
                "name": "铅山"
            },
            {
                "zip": "0315",
                "name": "迁西"
            },
            {
                "zip": "0513",
                "name": "启东"
            },
            {
                "zip": "0534",
                "name": "齐河"
            },
            {
                "zip": "023",
                "name": "綦江"
            },
            {
                "zip": "0559",
                "name": "祁门"
            },
            {
                "zip": "0598",
                "name": "清流"
            },
            {
                "zip": "0578",
                "name": "青田"
            },
            {
                "zip": "0763",
                "name": "清新"
            },
            {
                "zip": "0566",
                "name": "青阳"
            },
            {
                "zip": "0578",
                "name": "庆元"
            },
            {
                "zip": "0534",
                "name": "庆云"
            },
            {
                "zip": "0851",
                "name": "清镇"
            },
            {
                "zip": "0536",
                "name": "青州"
            },
            {
                "zip": "0391",
                "name": "沁阳"
            },
            {
                "zip": "028",
                "name": "邛崃"
            },
            {
                "zip": "0535",
                "name": "栖霞"
            },
            {
                "zip": "0550",
                "name": "全椒"
            },
            {
                "zip": "0797",
                "name": "全南"
            },
            {
                "zip": "0537",
                "name": "曲阜"
            },
            {
                "zip": "0751",
                "name": "曲江"
            }
        ]
    },
    {
        "initial": "R",
        "list": [
            {
                "zip": "0892",
                "name": "日喀则"
            },
            {
                "zip": "0633",
                "name": "日照"
            },
            {
                "zip": "0768",
                "name": "饶平"
            },
            {
                "zip": "0751",
                "name": "仁化"
            },
            {
                "zip": "0772",
                "name": "融安"
            },
            {
                "zip": "023",
                "name": "荣昌"
            },
            {
                "zip": "0631",
                "name": "荣成"
            },
            {
                "zip": "0772",
                "name": "融水"
            },
            {
                "zip": "0513",
                "name": "如东"
            },
            {
                "zip": "0513",
                "name": "如皋"
            },
            {
                "zip": "0577",
                "name": "瑞安"
            },
            {
                "zip": "0792",
                "name": "瑞昌"
            },
            {
                "zip": "0797",
                "name": "瑞金"
            },
            {
                "zip": "0631",
                "name": "乳山"
            },
            {
                "zip": "0379",
                "name": "汝阳"
            },
            {
                "zip": "0751",
                "name": "乳源"
            }
        ]
    },
    {
        "initial": "S",
        "list": [
            {
                "zip": "021",
                "name": "上海"
            },
            {
                "zip": "024",
                "name": "沈阳"
            },
            {
                "zip": "0755",
                "name": "深圳"
            },
            {
                "zip": "0311",
                "name": "石家庄"
            },
            {
                "zip": "0512",
                "name": "苏州"
            },
            {
                "zip": "0398",
                "name": "三门峡"
            },
            {
                "zip": "0598",
                "name": "三明"
            },
            {
                "zip": "0899",
                "name": "三亚"
            },
            {
                "zip": "0914",
                "name": "商洛"
            },
            {
                "zip": "0370",
                "name": "商丘"
            },
            {
                "zip": "0793",
                "name": "上饶"
            },
            {
                "zip": "0893",
                "name": "山南"
            },
            {
                "zip": "0754",
                "name": "汕头"
            },
            {
                "zip": "0660",
                "name": "汕尾"
            },
            {
                "zip": "0751",
                "name": "韶关"
            },
            {
                "zip": "0575",
                "name": "绍兴"
            },
            {
                "zip": "0739",
                "name": "邵阳"
            },
            {
                "zip": "0719",
                "name": "十堰"
            },
            {
                "zip": "0952",
                "name": "石嘴山"
            },
            {
                "zip": "0469",
                "name": "双鸭山"
            },
            {
                "zip": "0349",
                "name": "朔州"
            },
            {
                "zip": "0434",
                "name": "四平"
            },
            {
                "zip": "0438",
                "name": "松原"
            },
            {
                "zip": "0455",
                "name": "绥化"
            },
            {
                "zip": "0825",
                "name": "遂宁"
            },
            {
                "zip": "0722",
                "name": "随州"
            },
            {
                "zip": "0527",
                "name": "宿迁"
            },
            {
                "zip": "0557",
                "name": "宿州"
            },
            {
                "zip": "0772",
                "name": "三江"
            },
            {
                "zip": "0576",
                "name": "三门"
            },
            {
                "zip": "0596",
                "name": "诏安"
            },
            {
                "zip": "0795",
                "name": "上高"
            },
            {
                "zip": "0597",
                "name": "上杭"
            },
            {
                "zip": "0531",
                "name": "商河"
            },
            {
                "zip": "0799",
                "name": "上栗"
            },
            {
                "zip": "0771",
                "name": "上林"
            },
            {
                "zip": "0793",
                "name": "上饶"
            },
            {
                "zip": "0797",
                "name": "上犹"
            },
            {
                "zip": "0575",
                "name": "上虞"
            },
            {
                "zip": "0451",
                "name": "尚志"
            },
            {
                "zip": "0599",
                "name": "邵武"
            },
            {
                "zip": "0575",
                "name": "绍兴"
            },
            {
                "zip": "0598",
                "name": "沙县"
            },
            {
                "zip": "0580",
                "name": "嵊泗"
            },
            {
                "zip": "0575",
                "name": "嵊州"
            },
            {
                "zip": "0635",
                "name": "莘县"
            },
            {
                "zip": "0311",
                "name": "深泽"
            },
            {
                "zip": "0559",
                "name": "歙县"
            },
            {
                "zip": "0515",
                "name": "射阳"
            },
            {
                "zip": "0797",
                "name": "石城"
            },
            {
                "zip": "0871",
                "name": "石林"
            },
            {
                "zip": "0595",
                "name": "石狮"
            },
            {
                "zip": "0566",
                "name": "石台"
            },
            {
                "zip": "0751",
                "name": "始兴"
            },
            {
                "zip": "023",
                "name": "石柱"
            },
            {
                "zip": "0536",
                "name": "寿光"
            },
            {
                "zip": "0593",
                "name": "寿宁"
            },
            {
                "zip": "0564",
                "name": "寿县"
            },
            {
                "zip": "0451",
                "name": "双城"
            },
            {
                "zip": "028",
                "name": "双流"
            },
            {
                "zip": "0564",
                "name": "舒城"
            },
            {
                "zip": "0423",
                "name": "舒兰"
            },
            {
                "zip": "0599",
                "name": "顺昌"
            },
            {
                "zip": "0527",
                "name": "沭阳"
            },
            {
                "zip": "0527",
                "name": "泗洪"
            },
            {
                "zip": "0758",
                "name": "四会"
            },
            {
                "zip": "0537",
                "name": "泗水"
            },
            {
                "zip": "0557",
                "name": "泗县"
            },
            {
                "zip": "0527",
                "name": "泗阳"
            },
            {
                "zip": "0871",
                "name": "嵩明"
            },
            {
                "zip": "0599",
                "name": "松溪"
            },
            {
                "zip": "0379",
                "name": "嵩县"
            },
            {
                "zip": "0578",
                "name": "松阳"
            },
            {
                "zip": "0578",
                "name": "遂昌"
            },
            {
                "zip": "0796",
                "name": "遂川"
            },
            {
                "zip": "0516",
                "name": "睢宁"
            },
            {
                "zip": "0561",
                "name": "濉溪"
            },
            {
                "zip": "0759",
                "name": "遂溪"
            },
            {
                "zip": "0556",
                "name": "宿松"
            },
            {
                "zip": "0527",
                "name": "宿豫"
            }
        ]
    },
    {
        "initial": "T",
        "list": [
            {
                "zip": "022",
                "name": "天津"
            },
            {
                "zip": "0576",
                "name": "台州"
            },
            {
                "zip": "0315",
                "name": "唐山"
            },
            {
                "zip": "0901",
                "name": "塔城地"
            },
            {
                "zip": "0538",
                "name": "泰安"
            },
            {
                "zip": "0351",
                "name": "太原"
            },
            {
                "zip": "0523",
                "name": "泰州"
            },
            {
                "zip": "0938",
                "name": "天水"
            },
            {
                "zip": "0410",
                "name": "铁岭"
            },
            {
                "zip": "0919",
                "name": "铜川"
            },
            {
                "zip": "0435",
                "name": "通化"
            },
            {
                "zip": "0475",
                "name": "通辽"
            },
            {
                "zip": "0562",
                "name": "铜陵"
            },
            {
                "zip": "0856",
                "name": "铜仁"
            },
            {
                "zip": "0995",
                "name": "吐鲁番"
            },
            {
                "zip": "0512",
                "name": "太仓"
            },
            {
                "zip": "0558",
                "name": "太和"
            },
            {
                "zip": "0796",
                "name": "泰和"
            },
            {
                "zip": "0556",
                "name": "太湖"
            },
            {
                "zip": "0598",
                "name": "泰宁"
            },
            {
                "zip": "0750",
                "name": "台山"
            },
            {
                "zip": "0577",
                "name": "泰顺"
            },
            {
                "zip": "0523",
                "name": "泰兴"
            },
            {
                "zip": "0539",
                "name": "郯城"
            },
            {
                "zip": "0315",
                "name": "唐海"
            },
            {
                "zip": "0623",
                "name": "滕州"
            },
            {
                "zip": "0550",
                "name": "天长"
            },
            {
                "zip": "0576",
                "name": "天台"
            },
            {
                "zip": "0556",
                "name": "桐城"
            },
            {
                "zip": "0795",
                "name": "铜鼓"
            },
            {
                "zip": "0451",
                "name": "通河"
            },
            {
                "zip": "023",
                "name": "铜梁"
            },
            {
                "zip": "0562",
                "name": "铜陵"
            },
            {
                "zip": "0571",
                "name": "桐庐"
            },
            {
                "zip": "023",
                "name": "潼南"
            },
            {
                "zip": "0516",
                "name": "铜山"
            },
            {
                "zip": "0573",
                "name": "桐乡"
            },
            {
                "zip": "0513",
                "name": "通州"
            }
        ]
    },
    {
        "initial": "V",
        "list": []
    },
    {
        "initial": "W",
        "list": [
            {
                "zip": "0536",
                "name": "潍坊"
            },
            {
                "zip": "0631",
                "name": "威海"
            },
            {
                "zip": "027",
                "name": "武汉"
            },
            {
                "zip": "0510",
                "name": "无锡"
            },
            {
                "zip": "0913",
                "name": "渭南"
            },
            {
                "zip": "0876",
                "name": "文山"
            },
            {
                "zip": "0577",
                "name": "温州"
            },
            {
                "zip": "0473",
                "name": "乌海"
            },
            {
                "zip": "0553",
                "name": "芜湖"
            },
            {
                "zip": "0474",
                "name": "乌兰察布"
            },
            {
                "zip": "0991",
                "name": "乌鲁木齐"
            },
            {
                "zip": "0935",
                "name": "武威"
            },
            {
                "zip": "0953",
                "name": "吴忠"
            },
            {
                "zip": "0774",
                "name": "梧州"
            },
            {
                "zip": "0411",
                "name": "瓦房店"
            },
            {
                "zip": "0796",
                "name": "万安"
            },
            {
                "zip": "0731",
                "name": "望城"
            },
            {
                "zip": "0556",
                "name": "望江"
            },
            {
                "zip": "0793",
                "name": "万年"
            },
            {
                "zip": "0795",
                "name": "万载"
            },
            {
                "zip": "0537",
                "name": "微山"
            },
            {
                "zip": "0577",
                "name": "文成"
            },
            {
                "zip": "0631",
                "name": "文登"
            },
            {
                "zip": "0751",
                "name": "翁源"
            },
            {
                "zip": "0576",
                "name": "温岭"
            },
            {
                "zip": "0537",
                "name": "汶上"
            },
            {
                "zip": "0391",
                "name": "温县"
            },
            {
                "zip": "0558",
                "name": "涡阳"
            },
            {
                "zip": "0451",
                "name": "五常"
            },
            {
                "zip": "0534",
                "name": "武城"
            },
            {
                "zip": "0759",
                "name": "吴川"
            },
            {
                "zip": "0543",
                "name": "无棣"
            },
            {
                "zip": "0552",
                "name": "五河"
            },
            {
                "zip": "0553",
                "name": "芜湖"
            },
            {
                "zip": "0753",
                "name": "五华"
            },
            {
                "zip": "0311",
                "name": "无极"
            },
            {
                "zip": "0512",
                "name": "吴江"
            },
            {
                "zip": "0633",
                "name": "五莲"
            },
            {
                "zip": "023",
                "name": "武隆"
            },
            {
                "zip": "0771",
                "name": "武鸣"
            },
            {
                "zip": "0792",
                "name": "武宁"
            },
            {
                "zip": "0597",
                "name": "武平"
            },
            {
                "zip": "023",
                "name": "巫山"
            },
            {
                "zip": "0565",
                "name": "无为"
            },
            {
                "zip": "023",
                "name": "巫溪"
            },
            {
                "zip": "0579",
                "name": "武义"
            },
            {
                "zip": "0599",
                "name": "武夷山"
            },
            {
                "zip": "0793",
                "name": "婺源"
            },
            {
                "zip": "0391",
                "name": "武陟"
            }
        ]
    },
    {
        "initial": "X",
        "list": [
            {
                "zip": "0592",
                "name": "厦门"
            },
            {
                "zip": "029",
                "name": "西安"
            },
            {
                "zip": "0374",
                "name": "许昌"
            },
            {
                "zip": "0516",
                "name": "徐州"
            },
            {
                "zip": "0710",
                "name": "襄樊"
            },
            {
                "zip": "0732",
                "name": "湘潭"
            },
            {
                "zip": "0743",
                "name": "湘西"
            },
            {
                "zip": "0715",
                "name": "咸宁"
            },
            {
                "zip": "029",
                "name": "咸阳"
            },
            {
                "zip": "0712",
                "name": "孝感"
            },
            {
                "zip": "0479",
                "name": "锡林郭勒盟"
            },
            {
                "zip": "0482",
                "name": "兴安盟"
            },
            {
                "zip": "0319",
                "name": "邢台"
            },
            {
                "zip": "0971",
                "name": "西宁"
            },
            {
                "zip": "0373",
                "name": "新乡"
            },
            {
                "zip": "0376",
                "name": "信阳"
            },
            {
                "zip": "0790",
                "name": "新余"
            },
            {
                "zip": "0350",
                "name": "忻州"
            },
            {
                "zip": "0691",
                "name": "西双版纳"
            },
            {
                "zip": "0563",
                "name": "宣城"
            },
            {
                "zip": "0796",
                "name": "峡江"
            },
            {
                "zip": "0534",
                "name": "夏津"
            },
            {
                "zip": "0574",
                "name": "象山"
            },
            {
                "zip": "0515",
                "name": "响水"
            },
            {
                "zip": "0576",
                "name": "仙居"
            },
            {
                "zip": "0594",
                "name": "仙游"
            },
            {
                "zip": "0557",
                "name": "萧县"
            },
            {
                "zip": "0593",
                "name": "霞浦"
            },
            {
                "zip": "0851",
                "name": "息烽"
            },
            {
                "zip": "0379",
                "name": "新安"
            },
            {
                "zip": "0575",
                "name": "新昌"
            },
            {
                "zip": "0797",
                "name": "信丰"
            },
            {
                "zip": "0751",
                "name": "新丰"
            },
            {
                "zip": "0796",
                "name": "新干"
            },
            {
                "zip": "0797",
                "name": "兴国"
            },
            {
                "zip": "0523",
                "name": "兴化"
            },
            {
                "zip": "0753",
                "name": "兴宁"
            },
            {
                "zip": "0311",
                "name": "行唐"
            },
            {
                "zip": "0371",
                "name": "荥阳"
            },
            {
                "zip": "0792",
                "name": "星子"
            },
            {
                "zip": "0311",
                "name": "辛集"
            },
            {
                "zip": "0791",
                "name": "新建"
            },
            {
                "zip": "028",
                "name": "新津"
            },
            {
                "zip": "0311",
                "name": "新乐"
            },
            {
                "zip": "024",
                "name": "新民"
            },
            {
                "zip": "0371",
                "name": "新密"
            },
            {
                "zip": "0538",
                "name": "新泰"
            },
            {
                "zip": "0766",
                "name": "新兴"
            },
            {
                "zip": "0516",
                "name": "新沂"
            },
            {
                "zip": "0668",
                "name": "信宜"
            },
            {
                "zip": "0371",
                "name": "新郑"
            },
            {
                "zip": "0559",
                "name": "休宁"
            },
            {
                "zip": "023",
                "name": "秀山"
            },
            {
                "zip": "0792",
                "name": "修水"
            },
            {
                "zip": "0851",
                "name": "修文"
            },
            {
                "zip": "0391",
                "name": "修武"
            },
            {
                "zip": "0871",
                "name": "寻甸"
            },
            {
                "zip": "0797",
                "name": "寻乌"
            },
            {
                "zip": "0759",
                "name": "徐闻"
            },
            {
                "zip": "0517",
                "name": "盱眙"
            }
        ]
    },
    {
        "initial": "Y",
        "list": [
            {
                "zip": "0514",
                "name": "扬州"
            },
            {
                "zip": "0535",
                "name": "烟台"
            },
            {
                "zip": "0835",
                "name": "雅安"
            },
            {
                "zip": "0911",
                "name": "延安"
            },
            {
                "zip": "0433",
                "name": "延边"
            },
            {
                "zip": "0515",
                "name": "盐城"
            },
            {
                "zip": "0662",
                "name": "阳江"
            },
            {
                "zip": "0353",
                "name": "阳泉"
            },
            {
                "zip": "0831",
                "name": "宜宾"
            },
            {
                "zip": "0717",
                "name": "宜昌"
            },
            {
                "zip": "0458",
                "name": "伊春"
            },
            {
                "zip": "0795",
                "name": "宜春"
            },
            {
                "zip": "0999",
                "name": "伊犁哈萨克"
            },
            {
                "zip": "0951",
                "name": "银川"
            },
            {
                "zip": "0417",
                "name": "营口"
            },
            {
                "zip": "0701",
                "name": "鹰潭"
            },
            {
                "zip": "0737",
                "name": "益阳"
            },
            {
                "zip": "0746",
                "name": "永州"
            },
            {
                "zip": "0730",
                "name": "岳阳"
            },
            {
                "zip": "0775",
                "name": "玉林"
            },
            {
                "zip": "0912",
                "name": "榆林"
            },
            {
                "zip": "0359",
                "name": "运城"
            },
            {
                "zip": "0766",
                "name": "云浮"
            },
            {
                "zip": "0976",
                "name": "玉树"
            },
            {
                "zip": "0877",
                "name": "玉溪"
            },
            {
                "zip": "0662",
                "name": "阳春"
            },
            {
                "zip": "0662",
                "name": "阳东"
            },
            {
                "zip": "0635",
                "name": "阳谷"
            },
            {
                "zip": "0763",
                "name": "阳山"
            },
            {
                "zip": "0543",
                "name": "阳信"
            },
            {
                "zip": "0662",
                "name": "阳西"
            },
            {
                "zip": "0511",
                "name": "扬中"
            },
            {
                "zip": "0379",
                "name": "偃师"
            },
            {
                "zip": "0451",
                "name": "延寿"
            },
            {
                "zip": "0537",
                "name": "兖州"
            },
            {
                "zip": "0379",
                "name": "伊川"
            },
            {
                "zip": "0795",
                "name": "宜丰"
            },
            {
                "zip": "0794",
                "name": "宜黄"
            },
            {
                "zip": "0451",
                "name": "依兰"
            },
            {
                "zip": "0871",
                "name": "宜良"
            },
            {
                "zip": "0539",
                "name": "沂南"
            },
            {
                "zip": "0763",
                "name": "英德"
            },
            {
                "zip": "0558",
                "name": "颍上"
            },
            {
                "zip": "0539",
                "name": "沂水"
            },
            {
                "zip": "0579",
                "name": "义乌"
            },
            {
                "zip": "0559",
                "name": "黟县"
            },
            {
                "zip": "0510",
                "name": "宜兴"
            },
            {
                "zip": "0793",
                "name": "弋阳"
            },
            {
                "zip": "0379",
                "name": "宜阳"
            },
            {
                "zip": "0533",
                "name": "沂源"
            },
            {
                "zip": "0514",
                "name": "仪征"
            },
            {
                "zip": "0598",
                "name": "永安"
            },
            {
                "zip": "023",
                "name": "永川"
            },
            {
                "zip": "0595",
                "name": "永春"
            },
            {
                "zip": "0931",
                "name": "永登"
            },
            {
                "zip": "0597",
                "name": "永定"
            },
            {
                "zip": "0796",
                "name": "永丰"
            },
            {
                "zip": "0423",
                "name": "永吉"
            },
            {
                "zip": "0577",
                "name": "永嘉"
            },
            {
                "zip": "0579",
                "name": "永康"
            },
            {
                "zip": "0771",
                "name": "邕宁"
            },
            {
                "zip": "0591",
                "name": "永泰"
            },
            {
                "zip": "0796",
                "name": "永新"
            },
            {
                "zip": "0792",
                "name": "永修"
            },
            {
                "zip": "0598",
                "name": "尤溪"
            },
            {
                "zip": "023",
                "name": "酉阳"
            },
            {
                "zip": "0311",
                "name": "元氏"
            },
            {
                "zip": "0534",
                "name": "禹城"
            },
            {
                "zip": "0797",
                "name": "于都"
            },
            {
                "zip": "0556",
                "name": "岳西"
            },
            {
                "zip": "0793",
                "name": "余干"
            },
            {
                "zip": "0576",
                "name": "玉环"
            },
            {
                "zip": "0701",
                "name": "余江"
            },
            {
                "zip": "0766",
                "name": "郁南"
            },
            {
                "zip": "0766",
                "name": "云安"
            },
            {
                "zip": "0530",
                "name": "郓城"
            },
            {
                "zip": "0578",
                "name": "云和"
            },
            {
                "zip": "0596",
                "name": "云霄"
            },
            {
                "zip": "023",
                "name": "云阳"
            },
            {
                "zip": "0793",
                "name": "玉山"
            },
            {
                "zip": "0431",
                "name": "榆树"
            },
            {
                "zip": "0537",
                "name": "鱼台"
            },
            {
                "zip": "0315",
                "name": "玉田"
            },
            {
                "zip": "0574",
                "name": "余姚"
            },
            {
                "zip": "0931",
                "name": "榆中"
            }
        ]
    },
    {
        "initial": "Z",
        "list": [
            {
                "zip": "0596",
                "name": "漳州"
            },
            {
                "zip": "0371",
                "name": "郑州"
            },
            {
                "zip": "0760",
                "name": "中山"
            },
            {
                "zip": "0756",
                "name": "珠海"
            },
            {
                "zip": "0623",
                "name": "枣庄"
            },
            {
                "zip": "0744",
                "name": "张家界"
            },
            {
                "zip": "0313",
                "name": "张家口"
            },
            {
                "zip": "0936",
                "name": "张掖"
            },
            {
                "zip": "0759",
                "name": "湛江"
            },
            {
                "zip": "0758",
                "name": "肇庆"
            },
            {
                "zip": "0870",
                "name": "昭通"
            },
            {
                "zip": "0511",
                "name": "镇江"
            },
            {
                "zip": "0955",
                "name": "中卫"
            },
            {
                "zip": "0394",
                "name": "周口"
            },
            {
                "zip": "0580",
                "name": "舟山"
            },
            {
                "zip": "0396",
                "name": "驻马店"
            },
            {
                "zip": "0731",
                "name": "株洲"
            },
            {
                "zip": "0533",
                "name": "淄博"
            },
            {
                "zip": "0813",
                "name": "自贡"
            },
            {
                "zip": "028",
                "name": "资阳"
            },
            {
                "zip": "0852",
                "name": "遵义"
            },
            {
                "zip": "0311",
                "name": "赞皇"
            },
            {
                "zip": "020",
                "name": "增城"
            },
            {
                "zip": "0512",
                "name": "张家港"
            },
            {
                "zip": "0597",
                "name": "漳平"
            },
            {
                "zip": "0596",
                "name": "漳浦"
            },
            {
                "zip": "0531",
                "name": "章丘"
            },
            {
                "zip": "0795",
                "name": "樟树"
            },
            {
                "zip": "0543",
                "name": "沾化"
            },
            {
                "zip": "0311",
                "name": "赵县"
            },
            {
                "zip": "0535",
                "name": "招远"
            },
            {
                "zip": "0311",
                "name": "正定"
            },
            {
                "zip": "0599",
                "name": "政和"
            },
            {
                "zip": "0593",
                "name": "柘荣"
            },
            {
                "zip": "0371",
                "name": "中牟"
            },
            {
                "zip": "023",
                "name": "忠县"
            },
            {
                "zip": "0593",
                "name": "周宁"
            },
            {
                "zip": "029",
                "name": "周至"
            },
            {
                "zip": "0411",
                "name": "庄河"
            },
            {
                "zip": "0536",
                "name": "诸城"
            },
            {
                "zip": "0575",
                "name": "诸暨"
            },
            {
                "zip": "0762",
                "name": "紫金"
            },
            {
                "zip": "0794",
                "name": "资溪"
            },
            {
                "zip": "0537",
                "name": "邹城"
            },
            {
                "zip": "0543",
                "name": "邹平"
            },
            {
                "zip": "0315",
                "name": "遵化"
            }
        ]
    }
]
export default cityData